Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Tales of Sarimin The Jinn.tmx
Source language: id
Languages: en

source: *ANGGUK*
en: nod

source: HAHAHAHA!
en: hahaha

source: Kemari
en: come...

source: BRAKK!!
en: thud

source: KEMBALILAH KE
en: go back

source: Ada apa, tuh?
en: what’s going on here?

source: KOK DIAM
en: what’s

source: AYAH TETAP MEMILIH MENGURUS PEKERJAANNYA..
en: he would rather work.

source: Pasti besok jago main bola kayak ayahnya!
en: he sure is a soccer player, like his dad!

source: PESANKAN KE SUPPLIER,
en: deliver some bananas to him.

source: Oh..
en: oh hi,

source: *MENUNGGU DENGAN GUGUP*
en: waiting nervously

source: NAH!!
en: then!!!

source: PEKERJA DI SINI,
en: work here,

source: MAAF, YA..
en: I’m sorry...

source: TERNYATA TIDAK
en: for tresno!

source: SEDIKIT LAGI..!!
en: we’re almost there!

source: TERNYATA NGGAK
en: turns out,

source: BERUPA JIN MONYET
en: who

source: JANGAN DI-TEKUK, YA!
en: don’t bend them!

source: Sudah lupa dengan instruksi yang diberikan
en: already forgotten what was instructed.

source: DEG!!
en: thump

source: APA KATAMU??
en: what did you say?!

source: LUPA PERMISI DULU
en: you ask for permission first,

source: TAPI..
en: but...

source: SAMA AYAH, YA?!
en: miss me, baby?!

source: Hey, anak baru!
en: you, newbie!

source: BISA-
en: I don’t

source: Kami akan merindukan anda tuan Sarimin!
en: we’ll miss you so much, mr. sarimin!

source: BENERAN..?
en: about it?

source: HEI!
en: oi!

source: HEHEHE,
en: hahaha!

source: ITU SUARA TERIAKAN ANJAS!!
en: that sounds like anjas!

source: SRAK!
en: scoop

source: HEHEH..
en: hehehe...

source: KELUARGAKU..
en: is okay.

source: HAL MISTIS YANG TIDAK
en: the supernaturals

source: MINTA IZIN PADANYA!!
en: the project!

source: SUDAH CURIGA DARI
en: he was suspicious

source: Ya..
en: yeah...

source: AKAN SANGAT
en: some

source: BRAK!!
en: slam

source: HEH HEH..
en: hehehe...

source: ..KALAU
en: if you don’t

source: JELEK BANGET!!
en: a special move is that?!

source: RANDOM AJA
en: well, I’ll just go

source: BULUS SEKALIPUN..
en: power,

source: KAMU NGGAK DI-
en: you’re here to work,

source: DRAP
en: stomp

source: GIMANA NIHH?!
en: what do I do?!

source: JU..
en: seven...

source: MAS NGGAK
en: I don’t

source: M-MAS TRESNO!!
en: Tresno!

source: MENGHALANGI PEM-
en: stands between

source: KALAU AKU
en: If I were you,

source: 'HUMAN ERROR',
en: human errors,”

source: OMAE RA..!!!
en: hold on!

source: TAP
en: step

source: AKAN MENGKHIANATI-
en: I would’ve

source: SWOSH!!
en: swoosh

source: Yak, hentikan kendaraan anda di situ!
en: yes, pull over right there!

source: TIDAK MUNGKIN TRESNO
en: tresno wouldn’t have

source: NGAPAIN KAMU
en: why

source: HATI-HATI, DONG!!
en: please be careful!

source: KEMARILAH!!
en: come here, adit!

source: SUP KE RUMAH INI
en: how he sneaked

source: MALAH KABUR
en: don’t try to

source: SAMA ORANG ASING
en: by a weird guy

source: UDARANYA JUGA MASIH SEGAR SEKALI DAN LANGITNYA TERLIHAT BERSIH TANPA ASAP KENDARAAN..
en: the air is fresh and the sky is clear, and there’s no pollution in sight.

source: WAH, WAH..
en: hmm...

source: Tuan Sima..
en: master sima...

source: RAPA WAKTU LALU AYAH
en: you home

source: PEKERJA MULAI
en: have fallen victim

source: BUAT APA NGITUNGIN KUBURAN, KAK?!
en: why did you even do that?

source: LEWAT SINI!!
en: the right direction!

source: Aku sudah tidak sabar..
en: can't wait to get my hands on this.

source: WAH!
en: swoosh

source: HAPEKU!!!
en: my phone!

source: Jangan kepo..
en: don’t look...

source: KAN?!
en: you know?!

source: ANU, MON MAAP
en: Um, sorry

source: DEK GUNAWAN,
en: my useless

source: WILAYAHKU, TAPI
en: just shut

source: ..MBAH
en: master

source: INTINYA SAJA..
en: to the point.

source: NYEM
en: nom

source: SEEKOR MACAN TELAH TURUN GUNUNG..
en: I saw a tiger coming down from the mountain.

source: KARENA TAK SATUPUN
en: because none of you

source: Naik-naik ke puncak gunung (1)
en: let’s climb to the mountain top (1)

source: EEEEEEPP?!?!
en: eeeppp?!

source: AMBIL SAJA AKU SEBAGAI GANTINYA!!!
en: take me instead!!!

source: *Sirik tanda tak mampu*
en: tall poppy syndrome

source: Aku bisa mengandalkanmu, kan?
en: I can count on you, right?

source: SEMALAM..!?
en: last night?!

source: Aku tidak tahu harus bagaimana..
en: I don’t know what to do...

source: Kebelet pipis..
en: I need to use the bathroom...

source: Hmph!!
en: hmm?

source: AKU AKAN TAKUT
en: I’m

source: SEKARANG!!
en: up!!!

source: AKU, DEK RATNA!!
en: ratna!

source: Nama
en: Name

source: SAMPAINYA KAPAN, MAH?
en: mom, when will we get there?

source: AKU SUDAH MUAK!!!!
en: I’ve had enough!

source: DUA HARI INI AKU
en: I haven’t slept

source: Entah kenapa aku merasa bahwa ayah lah yang telah menyelamatkanku dari macan itu..
en: I think you were the one who saved me from that creature.

source: Kok nangis?
en: why are you crying?

source: ADA KENDALA ATAU
en: has there been any problem,

source: AKU BISA
en: I can

source: KAYAKNYA INI UDAH
en: It’s already

source: JIN INI PASTI MINTA
en: he wants us

source: GUSRAK
en: rustle

source: GUS
en: rustle

source: NYA KALIAN
en: you know

source: NYA SEMAKIN KUAT!!
en: will only get tighter!

source: TINUNG!
en: ding dong

source: TADI AKU PAKAI BUAT ME-MANASKAN LAUK..
en: I heated up our lunch with it.

source: OH TIDAKKK..
en: oh, no...

source: HANYA ISTRINYA YANG
en: it was only his wife

source: Jumlah pisang yang di dapatkan jadi sedikit, deh!
en: so, we didn’t have too many bananas here!

source: HEH
en: ha

source: GLODAKK!!
en: thud

source: PAGI TADI SAAT MENCARI RUMPUT UNTUK SAPI, AKU MELIHATNYA..
en: when I was looking for grass to feed my cows this morning,

source: AKU PERGI
en: I’m

source: MAAFKAN AKU..
en: forgive me...

source: MA..
en: wh-

source: Kau bisa terikat kembali dengan tempat itu..
en: you can be bound to that land again.

source: WAHAI MANUSIA..
en: dear mortals.

source: BELAJAR DARI KE-
en: a lot

source: P-PERASAAN
en: what’s

source: KURASA KAU
en: I guess

source: BALAS DENDAM KE PACAR
en: to cast on your pussy boyfriend,

source: SWOSH
en: swoosh

source: WISATA GUNUNG SIMATUNG VIA DUSUN JAYA
en: mount simatung through dusun jaya village

source: HAHAH--
en: hahaha--

source: SELAMAT
en: goodbye,

source: SURUH MENGANTARMU
en: the other

source: ..DUDUK
en: let’s sit

source: YANG MENGGANGGU
en: that has been messing

source: MENGOTORI TANGAN
en: get

source: NAIK-NAIK KE PUNCAK GUNUNG (2)
en: let’s climb to the mountain top (2)

source: Seharusnya aku tidak ketiduran setelah memesan makanan tadi..
en: I shouldn’t have fallen asleep after ordering some food.

source: KAKAK!!
en: wait!

source: K-KAKIKU NGGAK
en: I can’t move

source: KAMU KAYAKNYA
en: since you don’t

source: Emangnya kenapa?
en: what’s so wrong about that?

source: BUKAN MAKHLUK
en: “mean

source: SIMA SUDAH SAMPAI TURUN KE HUTAN..
en: since sima made it to the forest,

source: BUKAN..
en: no...

source: WAH, NGGAK KERASA, YA!
en: we’re here already?

source: SANA PIPIS
en: you can do your business

source: SEBELUM JIN ITU
en: before sarimin

source: MAAF YA, AKU PERGI TIDAK BILANG-BILANG, KAMU PASTI BINGUNG MENCARIKU..
en: sorry I didn’t tell you I was leaving. you must’ve been looking for me.

source: WA..
en: two...

source: JIWA DAN BELASAN
en: casualty and

source: TELANJANG?!
en: your clothes?!

source: UDAH NGGAK KETOLONG INI...
en: they can no longer be fixed.

source: GLO D
en: thud

source: ADA PROYEKAN DI
en: working

source: JIN SATU INI PALING
en: this jinn

source: GOYANG-GOYANG
en: is moving

source: Nyatanya mereka semua ada di sini, menjaga kalian sebagaimana mestinya
en: in fact, they’re here to keep an eye on all of you.

source: SEKARANG?
en: one now, huh?!

source: MENTANG-MENTANG
en: he’s only been rich

source: SUDAH UNTUK DI-
en: is really stubborn

source: BIKIN TIDAK TENANG SAJA!!!
en: it makes me feel uneasy!

source: DAN SAYA TIDAK AKAN DIAM SAJA!
en: I’ll do whatever it takes to find her!

source: INFORMASINYA
en: I’m going there now.

source: KRETEK
en: crack

source: BESOK, CULUN!!
en: four-eyes!

source: ATAU BERUNTUNG, YA?
en: about this or not.

source: AKU TIDAK AKAN
en: I wouldn’t meditated

source: GROKK!
en: oink

source: SE-SEKARANG?
en: y-you mean now?

source: Jadi kondisinya saat ini, wilayah praktik milik kami telah menjadi zona netral karena pohon keramat sebagai pusaka pingikat telah tercabut dari akarnya..
en: since the sacred tree, which was a binding heirloom, has been cut down, our practice area has become a neutral zone.

source: WAKTU TERASA
en: time froze

source: DI SINI…
en: still here...

source: FAVORITKU BARU
en: has just been

source: BALIK BADAN!!!
en: turn around!

source: OKE..
en: okay.

source: PAK SUNARYO..
en: mr. sunaryo.

source: SEKARANG
en: hmm... I think

source: SAYA TIDAK MAU
en: moment on,

source: LAIN KALI
en: please

source: KUHASUT UNTUK
en: won’t be

source: KAKINYA!!
en: on his leg!

source: TUING!
en: fwip

source: SINGKIRKAN?
en: taken away?

source: WA
en: chatter

source: JUGA..
en: instance.

source: MELAPORKAN
en: to report these

source: KAU INI
en: you’re

source: Iya, mah..
en: yes, I’m sure.

source: KEMAUANNYA, DIA
en: what he says.

source: KALIAN BERDUA YANG
en: you were the ones

source: PLEK!!
en: splat

source: KEDUA?!
en: chance?!

source: AKU JUGA SUDAH BER-TANYA KE PENGUNJUNG LAIN, NGGAK ADA YANG MELIHATNYA SAMA SEKALI!
en: I asked the other campers if they’d seen her, but no one had!

source: Bukannya tadi kita sudah melewati papan petunjuk ini?!
en: we’ve passed this sign before, right?!

source: HEI!!
en: hey!

source: Saat ini satu-satunya orang luar yang berada di tempat wisata ini hanyalah keluarga kalian..
en: you and your family are the only ones who aren’t from around here.

source: DULU..
en: it...

source: KIIIKK IKKIKKK IKIKKK!!
en: eek eeek eek!!!

source: WAH, HARUS
en: well, I think

source: ..KIIKKK..!!
en: eekkk!

source: AH, IYA..!!
en: oh, that’s right!

source: ANAK SEKARANG LARINYA CEPAT SEKALI YA..
en: kids these days sure are fast!

source: KAMERA HP AYAH KAN LEBIH BAGUS!
en: your phone has a better camera.

source: TUNGGU!!
en: no way!!!

source: Anju- kirain setan-
en: oh, um... I was just...

source: Catatan klienku sepertinya hilang, deh..
en: I think I’ve lost my list of clients.

source: PRANG!!
en: crack

source: MALU-MALU MONYET,
en: no need

source: POKOKNYA KAMI AKAN MENGERAH-KAN SELURUH TENAGA UNTUK MENEMUKAN PUTRI ANDA..
en: no matter what happens, we’ll do everything in our power to find your daughter.

source: KENAPA…..
en: why...

source: ..SONGONG JUGA
en: what an arrogant

source: AKU..
en: I...

source: Berbeda denganmu, aku tidak suka jadi pusat perhatian..
en: unlike you, I don’t look for attention.

source: SEMPAT BERURUSAN
en: ago.

source: SATU..
en: one...

source: Lalu kemudian terdengar suara ayah dari kejauhan..
en: that’s when I heard your voice in the distance...

source: VROOMM
en: vroom

source: WAHAI PARA
en: you vile

source: KAN HAWA SI
en: his

source: Sekarang tempat itu menjadi daerah netral...
en: since then, that area has become neutral territory.

source: BEBERAPA ORANG LANG-SUNG BERPENCAR UNTUK MENCARINYA..
en: they went looking for her right away.

source: APA ADA KEMAJUAN?!
en: do you have any news?

source: Yang kami inginkan..?
en: what we’re after?

source: Wisata gunung Simatung
en: MOUNT SIMATUNG

source: BUKTINYA
en: nothing

source: ..TAPI BAGAIMANA CARANYA KAMU BISA MENEMUKANKU TEPAT DI TEMPAT INI?
en: but, it’s a big mountain...

source: BOCORKAN HAL INI
en: snitched

source: JANGAN PURA-PURA GA TAU, KAK!!!
en: don’t act like you don’t know!

source: INGAT DENGANKU
en: remember me

source: M-MAU SAMPAI
en: how long

source: DUA TANGAN DAN
en: both your arms

source: MANUSIA AKAN
en: humans are

source: LAGI, NIH??
en: now?!

source: INI UNIT
en: so, this was

source: A..
en: d-

source: KRIK
en: chirp

source: SARIMIN.
en: tales of sarimin the jinn

source: AC, LAMPU, SUDAH MATI SEMUA..
en: I’ve also turned off the air conditioning and the lights.

source: SAAT BAHAGIAKU DUDUK BERDUA DENGAN-MU..
en: I’m happy when I’m with you...

source: KOK AKU
en: how did

source: DEG!
en: thump

source: AKU RELA!!)
en: mr. sima!)

source: KIK!
en: eek!

source: ADA CALON
en: you have

source: MASIH ADA DI SAKU CELANA KU!!
en: it’s in my pocket!

source: YA...
en: yes.

source: BRAK!
en: blam

source: DRR
en: bzzt

source: SUDAH GAGAL
en: I’ve failed

source: MENYALA TIBA-TIBA,
en: by itself,

source: STAPH!
en: stop!

source: Kok pintu jalannya ditutup?
en: why is the road being closed?

source: AAA
en: (redacted)

source: NGUEENG~
en: vroom

source: SET
en: fwip

source: IYA, KAMUU..!!
en: with the cart!

source: HARUS HEMAT LISTRIK!
en: we shouldn’t use electricity in a wasteful way.

source: HANYA KETAKUTAN!!
en: he was just scared!

source: SETAN ATAU PUN
en: if we encounter a ghost

source: AKU AMBIL
en: can I

source: Xixi..
en: haha...

source: Uluran tangan itu..
en: are you

source: DI LAPANGAN!
en: protocols!

source: DAPATKAN KONTAK-
en: contact from

source: Ayah, aku..
en: dad, I...

source: SIAPA BELUM
en: raise your hand if you want

source: POHON, TAPI JANGAN
en: but make sure

source: BEGITU!
en: chainsaw!

source: ADALAH MANUSIA
en: is a human

source: YANG SANGAT
en: evil aura

source: CKLEK!
en: click

source: ASLIMU,
en: strength,

source: CKLIK!
en: clack

source: JANGAN
en: please, don’t let me

source: MANA KALAU AYAH
en: that I was

source: Kok jalannya ditutup?
en: why are they closing the road?

source: KRIKKKK
en: chirp

source: KALAU KAU TERLALU
en: if you stay here

source: KOMPOR...
en: the stove...

source: Aktif banget, beb..
en: oh, our child is so playful...

source: BAGAIMANA?
en: so?!

source: SEKARANG..!!
en: what you’ve done!

source: ADA DI LUAR
en: I end up

source: NGAPAIN DI SINI?
en: what are you doing?!

source: MAAF YA,
en: sorry,

source: Menyedihkan sekali..
en: you are so pathetic.

source: Cepat jelaskan!!
en: then explain yourself!

source: TENTU SAJA
en: of course

source: WADIDAW!!!
en: wow!

source: APA YANG KALIAN LAKUKAN DI TENDA ANAK-ANAKKU?!
en: what are you doing inside my children’s tent?

source: TERTOLONG--
en: he’s gonna make it--

source: LEPASKAN SAJA TASNYA!!!!
en: just let go of the bag!

source: MAAFKAN
en: I

source: Tapi jangan nyampah di hutan, jangan sampai kebakaran juga!
en: just make sure you clean up the mess, we don’t want to start a forest fire, do we?

source: BERUNTUNG
en: just got

source: DORONG ITU..!!
en: the one

source: DUKUN SINTING
en: by

source: ARWAH, YANG DATANG
en: to our call, and his boss

source: BRAK
en: slam

source: MASA NYETEL LAGU BEGINI?!
en: why are you playing a nursery rhyme?

source: MAMAH LIHAT SEKILAS AJA UDAH SEREM..
en: that place has a creepy vibe to it, even at first glance.

source: SAJA DI DEKAT
en: by that tree over there,

source: ..KENAPA AKU BERKATA BEGITU?!?!
en: how could I even say that?!

source: M-MAKSUDMU
en: what do you

source: NAMA JURUSNYA
en: what kind of

source: HMPH..
en: hmm...

source: SURUH!!
en: like that!

source: Sepertinya mereka diberi obat bius-
en: perhaps the kids were drugged.

source: IBU JANGAN BER-PIKIRAN ANEH-ANEH YA, HARUS TETAP BERPIKIR POSITIF
en: don’t dwell on the negatives... instead, you should stay optimistic and pray for her safety.

source: ..Naik-naik ke puncak gunung..
en: let’s climb, let’s climb to the mountain top~

source: JANGAN BIARKAN
en: don’t let

source: TIM PENCARI SUDAH TURUN LAGI KE LAPANGAN
en: the search and rescue team has returned to the forest.

source: AYO BOBOK DI TENDA!!!
en: let’s sleep in the tent!

source: TUNGGU LAGI..
en: seems like we still need to wait.

source: DENGAN BEGINI AKU TIDAK JADI BUTA SEPANJANG CAMPING!
en: camping is a breeze now that I got my vision back!

source: BESOK SABTU BISA DATANG KE PENTAS TUTUP TAHUN?
en: can you come to the end-of-year festival on saturday?

source: SEMUA ADALAH
en: “they’re all

source: BISA MENEBAK,
en: can come

source: TAHU… HEHE..
en: either, haha.

source: SEKALI, LHO..
en: quite risky, you know...

source: URUSANMU,
en: you do

source: MAKHLUK
en: supernatural

source: NAH, KAN..
en: see?

source: BERENCANA UNTUK
en: on handing over

source: ZZZZ...
en: zzz...

source: WARGA KAMI PASTI AKAN MENEMU-KANNYA
en: our villagers will find her.

source: AKU NITIP KANTOR
en: please hold down

source: DIA MENGHUBUNGI-
en: since

source: ITU BEKAL DI TOTEBAG DIMAKAN AJA, KAK..
en: why don’t you eat what’s in that bag for now?

source: Okedeh..
en: alright.

source: KEPADAKU
en: to me.

source: M-MUNGKIN ITU
en: maybe it comes

source: ACK--- JANGAN PENGANG-PEGANG!!
en: ew! keep your hands off of me!

source: MUDA DARI DEK
en: way younger

source: EH??
en: hm?

source: KAMI MERASA
en: we knew

source: TERTIMPA BATU..
en: some of them were crushed by a rock...

source: PEMILIK ASLINYA..
en: to its rightful owner.

source: ULAR BIASA!!
en: not an ordinary snake!

source: TAHUN LALU AKU
en: several years

source: Kalau mereka sudah pergi dari sini, akan sulit untuk menemukan kesempatan lain!
en: it’d be hard to find another chance if they left this place!

source: MAU BERTINDAK MESUM
en: I knew you two were about

source: INI...
en: these...

source: BATS!!!
en: snap

source: PEDULI!!
en: care!

source: KARTU SAYA KEBAWA
en: my friend borrowed

source: HAH?
en: huh?

source: URGH..!!
en: argh!

source: MBAH DAMAR INI
en: master damar over there

source: JRENG!
en: dun

source: WUJUDMU AGAR KITA
en: yourself!

source: MATI, LHO..
en: for real.

source: BERURUSAN DENGANKU
en: go through me

source: ..AKU BUKAN
en: I don’t

source: JANGAN MALAH
en: why would you

source: Seakan-akan kita selalu berputar di daerah yang sama---
en: it was like I kept on going in circles.

source: MENGERIKAN..
en: grusome.

source: BALIK TENDA!!
en: to the tent!

source: MEREKA KABUR!!
en: they’re getting away!

source: KU, HEHE
en: champ.

source: TEMPAT ITU..
en: that place...

source: NAH..
en: all right,

source: TOLONG!!
en: help!!!

source: AKU TIDAK MAU
en: your words

source: ..SETELAH INI
en: I need

source: APALAGI KALAU
en: it’ll be even better

source: AHLI??
en: professional?

source: GIMANA JAWAB-
en: I don’t know

source: ..DARIPADA
en: instead of

source: Nanti kita bikin tenda di halaman rumah!
en: we can set up a tent in our backyard!

source: TANGKAP AKU, MAS!
en: come and get me!

source: S-SEORANG
en: a

source: SAAT SAYA KECIL, SAYA TIDAK TERLALU DEKAT DENGAN KEDUA ORANGTUA SAYA KARENA MEREKA BEKERJA DI LUAR KOTA..
en: when I was little, I didn’t spend much time with my parents because they had jobs that required them to be away from home.

source: BENARKAN ITU KENYATANNYA?!
en: do I really?

source: Antarkan pesanan ini ke kamar nomor 203!!
en: bring this dish to room 203!

source: MESIN TRUK MENYALA..
en: of a truck engine,

source: *TERBANG*
en: *fly*

source: INI SUDAH KETERLALUAN!!
en: you went too far!

source: BERI AKU 3 MENIT UNTUK MELAKUKAN PRESENTASI IDE BISNIS!!!!
en: give me three more minutes so I can tell you about my business concept!

source: TIDAKKAH KAU
en: don’t you

source: Setidaknya, dengan begitu boss Sima tidak akan merasa terganggu
en: at least, we wouldn’t bother mr.sima that way.

source: KAPAN K..
en: are you gonna

source: CTAR!
en: boom

source: ANU…
en: well...

source: NYAAA
en: gaaah!

source: NGANGGUR?!
en: what?!

source: GREB!
en: grab

source: PADAKU KALAU SEKARANG
en: a message,

source: Bapak tega sama kita?!
en: just let us through, please.

source: Kembalilah ke peran masing-masing!
en: return to your normal duties!

source: MAS TRESNO??
en: to say, tresno?

source: AYOK KAKAK JANGAN MAU KALAH, DONG!
en: come on, dear, don’t lose to anjas!

source: Hati-hati!
en: just be careful, you hear?

source: PAK!
en: yes,

source: PERCAYA SAMA YANG
en: believe

source: PAK SUNARYO BUKAN-
en: mr. sunaryo was not

source: Khu khu khu..
en: muahahaha!

source: AJAK NGOMONG..
en: and difficult to deal with.

source: LEBIH DULU..?
en: go first?

source: KE DALAM DIRINYA..
en: a glimpse of his soul...

source: DAN MENGANCAM
en: this man proceeded

source: SIAPA ITU?!!
en: who’s that?!

source: Terdengar seperti mimpi..
en: that sounded like a dream.

source: MBAH DAMAR..
en: instructed.

source: *BANTU BERDIRI*
en: *helping her to stand up*

source: YANG SINGKAT..?
en: me?

source: SEMUA SUDAH INCLUDE SESUAI YANG TERTERA DI APLIKASI, JADI TIDAK PERLU REPOT-REPOT MENDIRIKAN TENDA LAGI
en: it is stated in the app that the package includes camping gears, so there’s no need to build a tent.

source: CKIIT
en: screech

source: AKHIRKU TERLALU
en: was too

source: NANTI NYAMPE KE
en: if you take this route,

source: SETELAH AKU TERUSIR DARI SANA KUPIKIR KAMU PASTI LANGSUNG MENCARI RUMAH BARU DI ALAM LIAR..
en: I thought you were looking for a new place to live in the wild after I was kicked out of that place.

source: Permisii, yaa...!
en: excuse me!

source: MUDA, KAN?
en: aging well, yeah?

source: TERLUKA, PADAHAL
en: dozens injured...

source: KUBILANG, KAN!
en: told you!

source: KALIAN MASIH PERCAYA
en: that our culture

source: LILIN ITU..
en: that candle...

source: GEDUBRAAKKK!!!
en: thud

source: TAPI AKU DIAM SAJALAH
en: but I’m not gonna say anything about it.

source: Jangan sedih, Sima..
en: now now, sima...

source: HUWAAAA!!
en: waaa!!!

source: GYAHHH!!
en: waaa!!!

source: ITU KAN..
en: isn’t that

source: BODOAMAT ANJIR...!!
en: like I care!!!

source: NAIK-NAIK KE PUNCAK GUNUNG...
en: let’s climb, let’s climb, to the mountain top~

source: AKAN JADI
en: this

source: Aku tahu kau menyukainya
en: I know you like it.

source: AARRGGHH!!!!
en: arghhh!!!

source: ITU..
en: disturbances.

source: Jangan kabur-kabur lagi ya, nak..
en: please don’t leave us again, okay?

source: TIDAK PERNAH AMBIL
en: didn’t take any job

source: KAU..
en: you’re

source: KOLEGAKU
en: my colleagues.

source: M-MAS..
en: um...

source: Sampaikan salam perpisahanku kepada yang lain
en: send my best wishes to the others.

source: AKU SEGERA TERLELAP..
en: I start to drift away...

source: GAMPANG, TOLONG
en: please go ahead

source: SIAP
en: sir!

source: TERLAM..
en: too

source: MEREKA DATANG
en: they came

source: RITUAL APAPUN!
en: any kind of rituals before!

source: Kau pikir aku hanya menghabiskan waktu di kamar dengan berleha-leha dan menjadi instruktur senam poco-poco?
en: you think I’d just lounge around my room and teach aerobics instead?

source: AKU PASTI AKAN MEMBAWANYA KEMBALI
en: I promise I’ll bring her back to you.

source: SEKARANG BERITAHU
en: give me

source: TIDAK MASUK AKAL
en: make any sense.

source: BATS!
en: fwip

source: MENGKHIANATIKU,
en: down,

source: BERGUNA
en: gunawan.

source: SEBAIKNYA KITA KEMBALI DULU KE POS, BARU NANTI DILANJUTKAN DENGAN PERALATAN YANG LEBIH LENGKAP
en: we should go back to the post first, and then we’ll continue the search with better gears.

source: *TUNYUK*
en: poke

source: PEGANGIN!!
en: hold me!

source: Aku sudah diberi petunjuk oleh beliau!!
en: she looks exactly like the kid he described!

source: SIMBAHMU..?!
en: the place.

source: KALIAN ITU
en: you humans

source: SAYA TAHU WAJAH-
en: I know a couch potato

source: Aku mewakili seluruh warga desa..
en: I speak on behalf of the villagers...

source: RA
en: pow

source: SEPERTINYA AKU MENGENAL SUARA ITU...
en: I think I’ve heard that voice before.

source: BISA TERLUKA SEPARAH
en: ended up like that

source: Kita semua pernah mengambil keputusan yang salah!
en: we’ve all made the wrong choices.

source: sebentar lagi kita sampai parkiran!!
en: we’re getting closer to the parking lot!

source: MASIH MUDA
en: but people call him

source: AKU GANTI, YA..
en: I’ll change it.

source: HAAHH..
en: well,

source: OH?!?!
en: huh?!

source: TERTAMPAR
en: did that greasy shaman

source: BUATMU KELELAHAN
en: your power

source: HEH..
en: tsk...
